-----------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\delamb\data\ahbelong\logs\log_2018.09.05_22.15.04.txt
  log type:  text
 opened on:   5 Sep 2018, 22:15:04

. cd ..
C:\Users\delamb\data\ahbelong

. 
. 
. 
. 
. ***********************
. ** RENAMES & RECODES **
. ***********************
. 
. // Feels alienated from school
. recode s62e (4/5=1) (1/3=0), gen(alienated)
(4293 differences between s62e and alienated)

. label define noyes 0 "(0) No" 1 "(1) Yes"

. label values alienated noyes

. label var alienated "Feels Alienated from School"

. 
. // Any post-high school credential
. recode h4ed3a (1=0) (2/8=1), gen(credential)
(3697 differences between h4ed3a and credential)

. label values credential noyes

. label var credential "Any Post-High School Credential"

. 
. // Highest degree attained
. recode h4ed2 (1/2=1) (3=2) (4/6=3) (7/8=4) (9=5) (10=5) (11=6) (12=4) (13=5), gen(degree)
(5097 differences between h4ed2 and degree)

. label define degree 1 "(1) Less than H.S." 2 "(2) HS Grad/GED" 3 "(3) Some College/Trade/Voc School" 4 "(4) Bac
> helor's Degree" ///
>         5 "(5) Master's/Professional Degree" 6 "(6) Doctoral Degree"

. label values degree degree

. label var degree "Highest Education Attained, 2008"

. 
. // Dummy for sex
. recode bio_sex (1=0) (2=1), gen(female)
(6503 differences between bio_sex and female)

. label define sex 0 "(0) Male" 1 "(1) Female"

. label values female sex

. label var female "Sex, Self-Reported"

. 
. // Race/Ethnicity
. gen ethrace = 1 if s6a==1 & s6b==0 & s6c==0 & s6d==0 & s6e==0 & s4==0      // white only
(4,299 missing values generated)

. replace ethrace = 2 if s6a==0 & s6b==1 & s6c==0 & s6d==0 & s6e==0 & s4==0  // black only
(882 real changes made)

. replace ethrace = 3 if s6a==0 & s6b==0 & s6c==1 & s6d==0 & s6e==0 & s4==0  // asian only
(124 real changes made)

. replace ethrace = 4 if s6a==0 & s6b==0 & s6c==0 & s6d==1 & s6e==0 & s4==0  // native american only
(41 real changes made)

. replace ethrace = 5 if s6a==0 & s6b==0 & s6c==0 & s6d==0 & s6e==0 & s4==1  // hispanic ethnicity only
(145 real changes made)

. replace ethrace = 5 if s6a==0 & s6b==0 & s6c==0 & s6d==0 & s6e==1 & s4==1  // other+hispanic, coded as hispanic
(164 real changes made)

. replace ethrace = 7 if s6a==0 & s6b==0 & s6c==0 & s6d==0 & s6e==1 & s4==0  // other only
(41 real changes made)

. * next two lines code any multiples as "Two or More"
. replace ethrace = 6 if (s6a==1 & (s6b==1 | s6c==1 | s6d==1 | s6e==1 | s4==1)) | ///
>     (s6b==1 & (s6c==1 | s6d==1 | s6e==1 |s4==1)) | (s6c==1 & (s6d==1 | s6e==1 | s4==1)) | (s6d==1 & (s6e==1 | s
> 4==1))
(577 real changes made)

. label define ethrace 1 "(1) White" 2 "(2) Black" 3 "(3) Asian" 4 "(4) Native American" 5 "(5) Hispanic" 6 "(6) 
> Two or More" 7 "(7) Other"

. label values ethrace ethrace

. label var ethrace "Race/Ethnicity"

. 
. // Childhood household income
. gen hhinc94 = pa55/10 // Wave I household income in units of $10,000
(1,575 missing values generated)

. label var hhinc94 "Childhood Household Income, 1=$10K"

. 
. 
end of do-file

. corr alien cred
(obs=2,638)

             | aliena~d creden~l
-------------+------------------
   alienated |   1.0000
  credential |  -0.0928   1.0000


. pwcorr alien cred, sig

             | aliena~d creden~l
-------------+------------------
   alienated |   1.0000 
             |
             |
  credential |  -0.0928   1.0000 
             |   0.0000
             |

. pwcorr alien degree, sig

             | aliena~d   degree
-------------+------------------
   alienated |   1.0000 
             |
             |
      degree |  -0.1467   1.0000 
             |   0.0000
             |

. log close
      name:  <unnamed>
       log:  C:\Users\delamb\data\ahbelong\logs\log_2018.09.05_22.15.04.txt
  log type:  text
 closed on:   5 Sep 2018, 22:17:06
-----------------------------------------------------------------------------------------------------------------
